# Introduction to DDL and DML Statements

- ## [MySQL Installation Guide](https://cdn.upgrad.com/uploads/production/60901e07-0dc3-4aec-8ab5-520c0ddcebac/MySQL+Workbench+Installation.pdf)

In [ ]:
# https://github.com/catherinedevlin/ipython-sql/issues/191#issuecomment-824885235

!pip install "SQLAlchemy<1.4"

Looking in indexes: https://pypi.org/simple, https://us-python.pkg.dev/colab-wheels/public/simple/
Requirement already satisfied: SQLAlchemy<1.4 in /usr/local/lib/python3.10/dist-packages (1.3.24)

In [ ]:
%load_ext sql
# %reload_ext sql

In [ ]:
%%sql

sqlite:///vicks.db

SQL Command Types
---------

Which of the following command type(s) is/are available in SQL?

    Data Modification Language

    Data Definition Language

    Data Manipulation Language

    None of the above

----------

    Data Definition Language

    ✓ Correct
    Feedback:

Correct. DDL is a category of SQL commands.

    Data Manipulation Language

    ✓ Correct
    Feedback:

Correct. DML is a category of SQL commands.

# DDL Statements: A Demonstration

- create database `database_name`
- use `database_name`

DDL Statements
----------

DDL statements perform operations on which of the following database objects?

----------

Rows


Columns


    Tables

    ✓ Correct
    Feedback:
    Correct. DDL statements are used to create, modify and drop tables.


None of the above

Create a Table
---------

You are asked to compile data and analyse India's performance in the 2019 Cricket World Cup.

The first step that you would perform is to create a table with some columns with appropriate data types.

Write a query to create a table named 'India' with columns with the following data types:

    Matches_played – INT

    Matches_won – INT

    Matches_lost – INT

    Net_run_rate – DECIMAL(4,3)

    Points – INT

------------

    create table India (

      Matches_played int,

      Matches_won int,

      Matches_lost int,

      Net_run_rate decimal(4,3),

      Points int

    );

`Note`: The net run rate has the format decimal(4,3).

So, a value for the same can be 1.234.

In decimal(4,3), 4 is the total number of digits, while 3 is the total number of digits after the decimal point.

This is the SQL standard specification.

In [ ]:
%%sql

create table India (
  Matches_played int,
  Matches_won int,
  Matches_lost int,
  Net_run_rate decimal(4,3),
  Points int
);

 * sqlite:///vicks.db
Done.

[]

In [ ]:
%%sql

insert into India

(Matches_played, Matches_won, Matches_lost, Net_run_rate, Points)

values (10, 7, 3, 50.3, 100), (20, 15, 5, 60.7, 200);

 * sqlite:///vicks.db
2 rows affected.

[]

In [ ]:
%%sql

select * from India;

 * sqlite:///vicks.db
Done.

[(10, 7, 3, 50.3, 100), (20, 15, 5, 60.7, 200)]

# DML Statements: A Demonstration

DML Statements
-------

DML statements are used for:

-----------

    Deleting the data in a database

    ✓ Correct
    Feedback:

----------

Correct. DELETE is the DML statement used for this operation.


    Inserting data into a database

    ✓ Correct
    Feedback:

Correct. INSERT is the DML statement used for this operation.

-----------

Renaming a database

----------

Creating a table in a database

Writing an INSERT Statement
-------

Suppose you have an empty table named '`Wrestlers`',

which contains the following columns: Name, Wrestler_Rank, Height, Weight, Age.

Write a query to add the following values to this table:

- (Undertaker, 1, 208, 136, 54)
- (Kane, 2, 213, 147, 52)

--------

    insert into Wrestlers (Name, Wrestler_Rank, Height, Weight, Age)

    values ('Undertaker', 1, 208, 136, 54), ('Kane', 2, 213, 147, 52);

In [ ]:
%%sql

create table Wrestlers (
  Name varchar(20),
  Wrestler_Rank int,
  Height int,
  Weight int,
  Age int
);

 * sqlite:///vicks.db
Done.

[]

In [ ]:
%%sql

insert into Wrestlers (Name, Wrestler_Rank, Height, Weight, Age)

values ('Undertaker', 1, 208, 136, 54), ('Kane', 2, 213, 147, 52);

 * sqlite:///vicks.db
2 rows affected.

[]

In [ ]:
%%sql

select * from Wrestlers;

 * sqlite:///vicks.db
Done.

[('Undertaker', 1, 208, 136, 54), ('Kane', 2, 213, 147, 52)]

Modifying a Column
--------

Look at the table below.

It contains data about litre-wise petrol costs in some Indian cities.

**`Petrol_prices`**

![ss](https://images.upgrad.com/c8411243-979d-4a56-a1f8-5bf649710801-Capture.PNG)

Arun is a data analyst at Bharat Petroleum.

He mistakenly named the second column as Petrol_Quantity and set its data type as integer.

Imagine that you are one of his teammates.

Write the correct query to help Arun out.

-------

`Suggested Answer`

    alter table Petrol_prices

    change Petrol_Quantity Petrol_Price decimal(4,2);

# Practice Exercise – DDL and DML Statements

DDL and DML Statements
--------

Consider the following statements:

1. CREATE
2. INSERT
3. UPDATE
4. DELETE
5. ALTER
6. DROP
7. TRUNCATE
8. RENAME

Based on the types of DDL/DML statements, select the correct answers from the options given below.

Multiple options may be correct.

-------

    CREATE, UPDATE, DELETE and DROP are DDL statements.

--------

    SELECT, UPDATE, ALTER, DROP and RENAME are DML statements.

---------

    CREATE, ALTER, DROP, RENAME and TRUNCATE are DDL statements.

    ✓ Correct
    Feedback:

Correct. These keywords are part of DDL as they help with defining the schema or the database.

However, DML keywords are those keywords that help with manipulating the data in the rows of a table.

----------

    SELECT, INSERT, UPDATE and DELETE are DML statements.

    ✓ Correct
    Feedback:

Correct. These keywords are part of DDL as they help with defining the schema or the database.

However, DML keywords are those keywords that help with manipulating the data in the rows of a table.

----------

DDL and DML Statements
-------

What is the difference between the 'DROP' and 'TRUNCATE' commands?

--------

‘TRUNCATE’ removes a table completely from the database, and you cannot retrieve this table.

All the integrity constraints are removed.

On the other hand, ‘DROP’ only drops the table rows; it does not delete the schema of the table from the database.

-----

`‘DROP’` removes a table completely from the database, and you cannot retrieve this table.

All the integrity constraints are removed.

On the other hand, ‘TRUNCATE’ only drops the table rows; it does not delete the schema of the table from the database.

    ✓ Correct
    Feedback:

    This statement is correct.

-----

The table remains in the database when you use the ‘DROP’ command, but all of its rows will disappear.

---------

A table is deleted completely from the database when you use the ‘TRUNCATE’ command.

If you want to get this table, then you will need to create it again from scratch using the 'create table' command.

----------

DDL and DML Statements
----------

Suppose you want to create a table named '`mobile_phone`', which contains the following columns:

- Mobile_phone_ID, which is of integer type
- Camera, which is of string type
- RAM, which is of integer type
- Memory, which is of string type

The **primary key** of this table is '*Mobile_phone_ID*'.

What would be the correct SQL query to create such a table?

Also, identify the type of operation, i.e., whether it is a DDL statement or a DML statement.

--------

It is a DML statement.

    create table mobile_phone (

        Mobile_phone_ID int(11) NOT NULL,

        Camera varchar(12),

        RAM int(11),

        Memory varchar(12)

        );

------------

It is a DDL statement.

    create table mobile_phone (

        Mobile_phone_ID int(11) NOT NULL,

        Camera varchar(12),

        RAM int(11),

        Memory varchar(12)

        );

----------

It is a DML statement.

    create table mobile_phone (

        Mobile_phone_ID int(11) NOT NULL,

        Camera varchar(12),

        RAM int(11),

        Memory varchar(12),

        Primary Key (Mobile_phone_ID)

        );

-------------

`✓ Correct` It is a DDL statement.

    create table mobile_phone (

        Mobile_phone_ID int(11) NOT NULL,

        Camera varchar(12),

        RAM int(11),

        Memory varchar(12),

        Primary Key (Mobile_phone_ID)

        );

`Feedback`:

This is the correct method to create a table with the primary key.

-----------

In [ ]:
%%sql

create table mobile_phone (

     Mobile_phone_ID int(11) NOT NULL,

     Camera varchar(12),

     RAM int(11),

     Memory varchar(12),

     Primary Key (Mobile_phone_ID)

     );

 * sqlite:///vicks.db
Done.

[]

In [ ]:
%%sql select * from mobile_phone

 * sqlite:///vicks.db
Done.

[]

DDL and DML Statements
------

Suppose you want to add a new column, 'price', with ‘float’ as the data type, in the table '`mobile_phone`'.

What is the correct query to add this new column?

------------

    ALTER 'mobile_phone' ADD COLUMN 'price' float(24)

--------------

    ADD COLUMN 'price' float(24) IN TABLE 'mobile_phone'

--------

    ALTER TABLE 'mobile_phone' ADD COLUMN 'price' float(24)

    ✓ Correct
    Feedback:

This command is correct.

Run the query in the MySQL Workbench.

-------------

    ADD COLUMN 'price' float(24) IN 'mobile_phone'

--------

In [ ]:
%%sql ALTER TABLE 'mobile_phone' ADD COLUMN 'price' float(24)

 * sqlite:///vicks.db
Done.

[]

In [ ]:
%%sql select * from mobile_phone

 * sqlite:///vicks.db
Done.

[]

DDL and DML Statements
---------

Suppose you want to update the value of ‘Camera’ to 15MP, where RAM = 8.

What would be the correct query to perform such an operation?

----------

    update mobile_phone
    set Camera= '15MP'
    where RAM= 8;

    ✓ Correct
    Feedback:

This is the correct query to perform such an operation.

--------

    alter mobile_phone
    set Camera= '15MP'
    where RAM= 8;

----------

    insert Camera= '15MP'
    where RAM= 8;
    in table mobile_phone

----------

    update mobile_phone
    set Camera= '15MP'
    where RAM= '8';

-------

In [ ]:
%%sql

update mobile_phone
set Camera= '15MP'
where RAM= 8;

 * sqlite:///vicks.db
0 rows affected.

[]

#Summary

**DDL** (*Data Definition Language*) and **DML** (*Data Manipulation Language*) statements in MySQL

    The DDL statements are:

- CREATE
- ALTER
- DROP


    The DML statements are:

- INSERT
- UPDATE
- DELETE
- SELECT

<br>

While `Data Definition Language` statements are used to `alter the structure` of a database,

`Data Manipulation Language` statements are used to `change the data itself` that is present inside the database.